use mydb;

-- -----------------------------------------------------
-- Напишете заявка, която ви дава имената на всички книги
-- -----------------------------------------------------

select Title from Books;

-- -----------------------------------------------------
-- Напишете заявка, която изтрива най – старата книгата
-- -----------------------------------------------------

-- Подзавка и име на таблица, понеже в MySQL не може да се променя същата таблица, която се използва в SELECT частта

delete from Books where PubDate=(select min(X.PubDate) from (select PubDate from Books) as X);

delete from Books order by PubDate limit 1;

-- -----------------------------------------------------
-- Напишете заявка, която променя годината на публикуване на всички книги, като добавя към текущата година още 10 години.
-- -----------------------------------------------------

update Books set PubDate = date_add(PubDate, interval 10 year);

-- -----------------------------------------------------
-- Напишете заявка, която дава средната големина на книгите
-- -----------------------------------------------------

select avg(NumPages) from Books;

-- -----------------------------------------------------
-- Заявка показваща всяка книга в кой приятел се намира. Показвайки само книгите, които са дадени
-- -----------------------------------------------------

select Title, FirstName, LastName, Phone
    from Books b join Friends f on b.Friends_ID = f.ID;
    
-- -----------------------------------------------------
-- Заявка показваща всяка книга в кой приятел се намира. Показвайки само книгите, които са дадени
-- -----------------------------------------------------

select Title from Books where Friends_ID is NULL;

-- -----------------------------------------------------
-- Заявка показваща всички книги. Информация дали са дадени на някой приятел и NULL запис ако книгата не е дадена на приятел
-- -----------------------------------------------------
    
select Title, NumPages, PubDate, FirstName, LastName
    from Books b left join Friends f on b.Friends_ID = f.ID;


-- -----------------------------------------------------
-- Направете заяка, която показва данни за приятел прочел най – много книги.
-- -----------------------------------------------------

select FirstName, LastName,  count(h.Friends_ID)
    from History h join Friends f on h.Friends_ID=f.ID 
    group by h.Friends_ID asc limit 1;
        
-- -----------------------------------------------------
-- Направете заявка, която показва коя книга е била прочетена най – малко пъти.
-- -----------------------------------------------------

select Title, count(Title) as counted
    from Books b join History h on b.ID=h.Books_ID
    group by Title desc limit 1;
